# Pandas

In [4]:
# load library
import pandas as pd

**Creating a data frame**

In [5]:
data = pd.DataFrame(
    {
        'Country':['Russia','India','Chile'],
        'Rank':[121,130,100]
    }
)

In [6]:
data

  Country  Rank
0  Russia   121
1   India   130
2   Chile   100

***quick analysis of data***

This method computes summary of integer/double variables only.

In [8]:
data.describe()

             Rank
count    3.000000
mean   117.000000
std     15.394804
min    100.000000
25%    110.500000
50%    121.000000
75%    125.500000
max    130.000000

***How about describing the DataFrame like \d in Postgres***

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
Country    3 non-null object
Rank       3 non-null int64
dtypes: int64(1), object(1)
memory usage: 120.0+ bytes

## Sorting

In [15]:
data = pd.DataFrame(
    {
        'group':['a','a','a','b','b','b','c','c','c'],
        'ounces':[4,3,12,6,7.5,8,3,5,6]
    }
)

In [16]:
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [17]:
data.sort_values(by=['ounces'],ascending=True,inplace=False)

  group  ounces
1     a     3.0
6     c     3.0
0     a     4.0
7     c     5.0
3     b     6.0
8     c     6.0
4     b     7.5
5     b     8.0
2     a    12.0

***sorting by multiple columns***

So, let's sort by group first. But if group same, then descending order of ounces. :-)

In [18]:
data.sort_values(by=['group','ounces'],ascending=[True,False],inplace=False)

  group  ounces
2     a    12.0
0     a     4.0
1     a     3.0
5     b     8.0
4     b     7.5
3     b     6.0
8     c     6.0
7     c     5.0
6     c     3.0

## Removing duplicate rows/columns

In [19]:
data = pd.DataFrame(
    {
        'k1':['one']*3+['two']*4,
        'k2':[3,2,1,3,3,4,4]
    }
)

***Sorting by default is inplace***

In [20]:
data.sort_values(by='k2')

    k1  k2
2  one   1
1  one   2
0  one   3
3  two   3
4  two   3
5  two   4
6  two   4

***Removing duplicate rows***

Note that this does not change data but give you data without duplicates. Not inplace by default.

In [21]:
data.drop_duplicates()

    k1  k2
0  one   3
1  one   2
2  one   1
3  two   3
5  two   4

***Removing column duplicates***

This also doesn't do inplace. So, data remains same.

In [23]:
data.drop_duplicates(subset='k1')

    k1  k2
0  one   3
3  two   3

## Creating a new column based on previous data

*** Notice how one data point which is in decimal makes the whole column with decimals ***

In [25]:
data = pd.DataFrame(
{
    'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
    'ounces':[4,3,12,6,7.5,8,3,5,6]
}
)

In [26]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [27]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

** Creating new column animal**

This will create a new column animal based on the mapping in the dictionary above

In [28]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [29]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

**Another way to do this is using a method to get the dictionary type waali mapping.**

In [30]:
def meat_2_animal(series):
    if series['food'] == 'bacon':
        return 'pig'
    elif series['food'] == 'pulled pork':
        return 'pig'
    elif series['food'] == 'pastrami':
        return 'cow'
    elif series['food'] == 'corned beef':
        return 'cow'
    elif series['food'] == 'honey ham':
        return 'pig'
    else:
        return 'salmon'

In [31]:
lower = lambda x:x.lower()

In [32]:
data['food'] = data['food'].apply(lower)
data['animal2ndWay'] = data.apply(meat_2_animal, axis='columns')

In [33]:
data

          food  ounces  animal animal2ndWay
0        bacon     4.0     pig          pig
1  pulled pork     3.0     pig          pig
2        bacon    12.0     pig          pig
3     pastrami     6.0     cow          cow
4  corned beef     7.5     cow          cow
5        bacon     8.0     pig          pig
6     pastrami     3.0     cow          cow
7    honey ham     5.0     pig          pig
8     nova lox     6.0  salmon       salmon

**Another way to create new column is using assign function**

In [35]:
data.assign(TenTimesOunces = data['ounces']*10)

          food  ounces  animal animal2ndWay  TenTimesOunces
0        bacon     4.0     pig          pig            40.0
1  pulled pork     3.0     pig          pig            30.0
2        bacon    12.0     pig          pig           120.0
3     pastrami     6.0     cow          cow            60.0
4  corned beef     7.5     cow          cow            75.0
5        bacon     8.0     pig          pig            80.0
6     pastrami     3.0     cow          cow            30.0
7    honey ham     5.0     pig          pig            50.0
8     nova lox     6.0  salmon       salmon            60.0

***Dropping a column from our data***

In [36]:
data.drop('animal2ndWay',axis='columns',inplace=True)

In [37]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Replacing/Fixing missing values in data

**Creating an array in pandas using Series**

In [38]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [39]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

**Replace -999 with NaN values**

In [42]:
import numpy as np
data.replace(-999, np.nan, inplace=True)

In [43]:
data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

**Replace NaN with 42**

In [44]:
data.replace(np.nan, 42, inplace=True)
data

0       1.0
1      42.0
2       2.0
3      42.0
4   -1000.0
5       3.0
dtype: float64

## Another way of creating Data in Pandas

**Here we specify the row header, column headers separately and data separately**

In [45]:
data = pd.DataFrame(
    np.arange(12).reshape((3,4)),
    index=['Ohio','Colorado','New York'],
    columns=['one','two','three','four']
)

In [46]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

## Renaming rows/columns in Pandas

In [47]:
data.rename(
    index = {'Ohio':'SanF'},
    columns = {'one':'one_p', 'two':'two_p'},
    inplace=True
)

In [48]:
data

          one_p  two_p  three  four
SanF          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

We can also use string functions

In [49]:
data.rename(
    index = str.upper,
    columns = str.title,
    inplace=True
)

In [50]:
data

          One_P  Two_P  Three  Four
SANF          0      1      2     3
COLORADO      4      5      6     7
NEW YORK      8      9     10    11

## Categorization of continuous variables

In [1]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [2]:
bins = [18, 25, 35, 60, 100]

In [5]:
cats = pd.cut(ages,bins)

In [6]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

***pandas also assigns encodig to categorical variables***

In [8]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

***How many values in each category?***

Remember that unlike maths, here, ( means it is included, and ] means it is not.

In [9]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

***labels for groups?***

In [10]:
group_names = ['youth','youngAdult','MiddleAge','Senior']

In [11]:
new_cats = pd.cut(ages, bins, labels=group_names)

In [12]:
pd.value_counts(new_cats)

youth         5
youngAdult    3
MiddleAge     3
Senior        1
dtype: int64

**We can also calculate their cumulative sum**

In [13]:
pd.value_counts(new_cats).cumsum()

youth          5
youngAdult     8
MiddleAge     11
Senior        12
dtype: int64

## Grouping and Pivots

In [15]:
import numpy as np
d = pd.DataFrame(
    {
        'key1':['a','a','b','b','a'],
        'key2':['one','two','one','two','one'],
        'data1':np.random.randn(5),
        'data2':np.random.randn(5)
    }
)

In [16]:
d

      data1     data2 key1 key2
0  1.011549  0.778251    a  one
1 -0.467835 -2.509399    a  two
2 -0.443363 -0.507551    b  one
3  0.801738  1.347290    b  two
4 -1.215944 -0.129946    a  one

In [17]:
groupByKey1 = d.groupby(d['key1'])
groupByKey1

In [18]:
groupByKey1.mean()

         data1     data2
key1
a    -0.224077 -0.620365
b     0.179188  0.419869

***Finding mean of data1 column by key1***

In [19]:
grouped = d['data1'].groupby(d['key1'])
grouped.mean()

key1
a   -0.224077
b    0.179188
Name: data1, dtype: float64

## Slicing / Filtering / Searching data frame

In [20]:
dates = pd.date_range('20130101',periods=6)

In [21]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [24]:
df

                   A         B         C         D
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569
2013-01-05 -0.877862 -0.461876 -0.707167 -0.708610
2013-01-06  0.223259 -0.239380  1.077358 -0.301199

In [27]:
# Get first 3 rows from data frame
df[:3]

                   A         B         C         D
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644

In [28]:
# Slice based on date range
df['20130101':'20130104']

                   A         B         C         D
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569

In [30]:
# Slice based on column names
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.551929  0.556841
2013-01-02 -1.631583 -0.066275
2013-01-03 -0.353112 -2.522310
2013-01-04 -0.358984 -0.281498
2013-01-05 -0.877862 -0.461876
2013-01-06  0.223259 -0.239380

In [32]:
#slicing based on both row index labels and column names
df.loc['20130101':'20130103',['A','B']]

                   A         B
2013-01-01 -0.551929  0.556841
2013-01-02 -1.631583 -0.066275
2013-01-03 -0.353112 -2.522310

In [33]:
#Slicing based on index of columns
df.iloc[3]  # returns the 4th row

A   -0.358984
B   -0.281498
C   -0.491911
D   -1.463569
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
# Return specific set of rows using indexes
df.iloc[2:4,0:2]

                   A         B
2013-01-03 -0.353112 -2.522310
2013-01-04 -0.358984 -0.281498

In [35]:
# Return specific rows & columns using lists containing columns or row indexes
df.iloc[[1,5],[0,2]]

                   A         C
2013-01-02 -1.631583  1.419674
2013-01-06  0.223259  1.077358

In [36]:
df.iloc[[1,5],]

                   A         B         C         D
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374
2013-01-06  0.223259 -0.239380  1.077358 -0.301199

In [38]:
# Boolean / Comparison indexing based on column values
df[df.A > -1]

                   A         B         C         D
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569
2013-01-05 -0.877862 -0.461876 -0.707167 -0.708610
2013-01-06  0.223259 -0.239380  1.077358 -0.301199

**Copying the dataset**

In [39]:
df2 = df.copy()

In [41]:
df2['E'] = ['one','one','two','three','four','three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552    one
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374    one
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644    two
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569  three
2013-01-05 -0.877862 -0.461876 -0.707167 -0.708610   four
2013-01-06  0.223259 -0.239380  1.077358 -0.301199  three

In [43]:
#select rows based on column values
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644   two
2013-01-05 -0.877862 -0.461876 -0.707167 -0.708610  four

In [44]:
# select all rows except those with two and four
df2[~df2['E'].isin(['two','four'])]

                   A         B         C         D      E
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552    one
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374    one
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569  three
2013-01-06  0.223259 -0.239380  1.077358 -0.301199  three

In [45]:
# Comparitive boolean slicing - List all columns where A > C
df.query('A > C')

                   A         B         C         D
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569

In [46]:
# We can also use OR condition
df.query('A < B | C > A')

                   A         B         C         D
2013-01-01 -0.551929  0.556841 -1.045690 -1.561552
2013-01-02 -1.631583 -0.066275  1.419674 -0.608374
2013-01-03 -0.353112 -2.522310 -0.232859 -1.843644
2013-01-04 -0.358984 -0.281498 -0.491911 -1.463569
2013-01-05 -0.877862 -0.461876 -0.707167 -0.708610
2013-01-06  0.223259 -0.239380  1.077358 -0.301199

### Pivoting
Pivots are extremely useful in analyzing data using a tabular format

In [47]:
data = pd.DataFrame(
    {
        'group':['a','a','a','b','b','b','c','c','c'],
        'ounces':[4,3,12,6,7.5,8,3,5,6]
    }
)

In [48]:
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

**Calculate means of each group**

In [49]:
data.pivot_table(values='ounces',index='group',aggfunc=np.mean)

         ounces
group
a      6.333333
b      7.166667
c      4.666667

**Calculate count of each group**

In [51]:
data.pivot_table(values='ounces',index='group',aggfunc='count')

       ounces
group
a           3
b           3
c           3